Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedTemperatureLoad.VerticalTemperatureDifference Property
 The vertical temperature difference of the decomposed temperature load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double VerticalTemperatureDifference { get; }
Public ReadOnly Property VerticalTemperatureDifference As Double
	Get
Property Value
Type: Double
See Also
Reference
AnalysisDecomposedTemperatureLoad Class
Tekla.Structures.Analysis Namespace